In [41]:
import pandas as pd
df = pd.read_csv(r"C:\Users\G.M.BHOOPESH\Desktop\ds\study materials\machine learning\train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [42]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [43]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [44]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [45]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [46]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [47]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [48]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [49]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [50]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [51]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [52]:
model.fit(X_train,y_train)

GaussianNB()

In [53]:
model.score(X_test,y_test)

0.7910447761194029

In [54]:
X_test[0:10]

     Pclass        Age     Fare  female
167       3  45.000000  27.9000       1
10        3   4.000000  16.7000       1
719       3  33.000000   7.7750       0
728       2  25.000000  26.0000       0
868       3  29.699118   9.5000       0
767       3  30.500000   7.7500       1
595       3  36.000000  24.1500       0
756       3  28.000000   7.7958       0
515       1  47.000000  34.0208       0
0         3  22.000000   7.2500       0

In [55]:
y_test[0:10]

C:\Users\G.M.BHOOPESH\AppData\Local\Temp\ipykernel_10836\2966258366.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  y_test[0:10]

167    0
10     1
719    0
728    0
868    0
767    0
595    0
756    0
515    0
0      0
Name: Survived, dtype: int64

In [56]:
model.predict(X_test[0:10])

array([1, 1, 0, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [57]:
model.predict_proba(X_test[:10])

array([[0.39063461, 0.60936539],
       [0.24840713, 0.75159287],
       [0.95820627, 0.04179373],
       [0.90399743, 0.09600257],
       [0.95639094, 0.04360906],
       [0.36345132, 0.63654868],
       [0.95858856, 0.04141144],
       [0.95500656, 0.04499344],
       [0.77601219, 0.22398781],
       [0.9501199 , 0.0498801 ]])

In [58]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.712     , 0.808     , 0.704     , 0.79032258, 0.85483871])